# 1.0 Importing the Libraries to be used

In [3]:
import pandas as pd
import numpy as np

# 1.1 Loading the various Data Sets

In [8]:
#CDR excel file
url='/content/CDR_description.xlsx'
df1=pd.read_excel('/content/CDR_description.xlsx')
df1
df1.head(10)

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [9]:
# Loading the geo description excel file
geo_description ='/content/cells_geo_description.xlsx'
df2=pd.read_excel('/content/cells_geo_description.xlsx')
df2
df2.head(10)

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String
5     LONGITUDE          Longitude   Float
6      LATITUDE           Latitude   Float
7        REGION             Region  String
8          AREA               Area  String
9       CELL_ID     ID of the cell  String

In [10]:
# Loading the cells_geo.csv
geo_csv ='/content/cells_geo.csv'
#df3=pd.read_csv('/content/cells_geo.csv')
df3=pd.read_csv('/content/cells_geo.csv',delimiter=';', index_col=0)
df3
df3.head(10)

     VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0    ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1    ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2    ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3   ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4   ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f
5   ASSINIE  In Service    INTERIEUR  ...  NaN  0b4f56438f  8a1e6ce31f
6  KRIKOREA  In Service    INTERIEUR  ...  NaN  041d2504f5  260dbfedc5
7     ABOBO  In Service      ABIDJAN  ...  NaN  a70c1d263b  56306cc7ca
8     ABOBO  In Service      ABIDJAN  ...  NaN  e2d04ea883  56306cc7ca
9     ABOBO         NaN      ABIDJAN  ...  NaN  ee224cd27e  56306cc7ca

[10 rows x 11 columns]

In [11]:
#Loading telecom_dataset1
telecom_dataset1='/content/Telcom_dataset.csv'
df4=pd.read_csv('/content/Telcom_dataset.csv')
df4
df4.head(3)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi

[3 rows x 10 columns]

In [12]:
# Deleting irrelevant columns in telecom_dataset1
df4.drop('COUNTRY_A',axis=1,inplace=True)
df4.drop('COUNTRY_B',axis=1,inplace=True)
df4.drop('CELL_ON_SITE',axis=1,inplace=True)
df4.head(2)

  PRODUTC  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41

[2 rows x 7 columns]

In [13]:
#Loading telecom_dataset2
telecom_dataset2='/content/Telcom_dataset2.csv'
df5=pd.read_csv('/content/Telcom_dataset2.csv')
df5
df5.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q

[3 rows x 10 columns]

In [14]:
# Deleting irrelevant columns in telecom_dataset2
df5.drop('COUNTRY_A',axis=1,inplace=True)
df5.drop('COUNTRY_B',axis=1,inplace=True)
df5.drop('CELL_ON_SITE',axis=1,inplace=True)
df5.head(3)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q

[3 rows x 7 columns]

In [15]:
# Loading telecom_dataset3
#telecom_dataset3='/content/Telcom_dataset3.csv'
df6=pd.read_csv('/content/Telcom_dataset3.csv')
df6
df6.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

In [16]:
# Deleting irrelevant columns in telecom_dataset3
df6.drop('COUNTRY_A',axis=1,inplace=True)
df6.drop('COUNTRY_B',axis=1,inplace=True)
df6.drop('CELL_ON_SITE',axis=1,inplace=True)
df6.head(3)

  PRODUCT  VALUE  ...      CELLID     SIET_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 7 columns]

# 1.2 Perform data cleaning

In [17]:
#Changing the column names to lower case
# telecom_dataset1
df4.columns = map(str.upper, df4.columns)
df4.columns

Index(['PRODUTC', 'VALUE', 'DATETIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT',
       'CELL_ID', 'SITE_ID'],
      dtype='object')

In [18]:
#Changing the column names to lower case
#telecom_dataset2
df5.columns = map(str.upper, df5.columns)
df5.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'DW_A_NUMBER', 'DW_B_NUMBER',
       'CELL_ID', 'SITE_ID'],
      dtype='object')

In [19]:
#Changing the column names to lower case
#telecom_dataset3
df6.columns = map(str.upper, df6.columns)
df6.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT',
       'CELLID', 'SIET_ID'],
      dtype='object')

In [20]:
#Renaming the Columns
df4.rename(columns={'PRODUTC':'PRODUCT','DATETIME':'DATE_TIME','CELLID':'CELL_ID','DW_A_NUMBER':'DW_A_NUMBER_INT','DW_B_NUMBER':'DW_B_NUMBER_INT','SIET_ID':'SITE_ID'},inplace=True)

In [21]:
df5.rename(columns={'PRODUTC':'PRODUCT','DATETIME':'DATE_TIME','CELLID':'CELL_ID','DW_A_NUMBER':'DW_A_NUMBER_INT','DW_B_NUMBER':'DW_B_NUMBER_INT','SIET_ID':'SITE_ID'},inplace=True)

In [22]:
df6.rename(columns={'PRODUTC':'PRODUCT','DATETIME':'DATE_TIME','CELLID':'CELL_ID','DW_A_NUMBER':'DW_A_NUMBER_INT','DW_B_NUMBER':'DW_B_NUMBER_INT','SIET_ID':'SITE_ID'},inplace=True)

# 1.3 Merging the tables

In [23]:
# Concantinating the three telecom_datasets
df_7 = pd.concat([df4,df5,df6], axis = 0,ignore_index = True)
df_7.head(5)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv

[5 rows x 7 columns]

In [24]:
# Merging Geo-cells data frame and the telecom datasets

#df8 = pd.concat([df_7,df3],axis = 1)
#df8
#df8 = pd.concat([df3,df_7], axis = 1)
#df8.head(5)
df8 = pd.merge(df_7,df3,how='inner',left_on='SITE_ID',right_on='SITE_CODE')
df8.head(5)

  PRODUCT  VALUE              DATE_TIME  ...          AREA   CELL_ID_y   SITE_CODE
0     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  24ccdda3d5  1b5540c02d
1     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  ebfc58af70  1b5540c02d
2     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  ba8ce6e4ef  1b5540c02d
3     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  c2545171dc  1b5540c02d
4     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  f15bd5483f  1b5540c02d

[5 rows x 18 columns]

In [25]:
# drop duplicated values
df8.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
51356    False
51357    False
51358    False
51359    False
51360    False
Length: 51361, dtype: bool

In [26]:
# Check missing values
df8.isnull()

       PRODUCT  VALUE  DATE_TIME  ...   AREA  CELL_ID_y  SITE_CODE
0        False  False      False  ...  False      False      False
1        False  False      False  ...  False      False      False
2        False  False      False  ...  False      False      False
3        False  False      False  ...  False      False      False
4        False  False      False  ...  False      False      False
...        ...    ...        ...  ...    ...        ...        ...
51356    False  False      False  ...  False      False      False
51357    False  False      False  ...  False      False      False
51358    False  False      False  ...  False      False      False
51359    False  False      False  ...  False      False      False
51360    False  False      False  ...  False      False      False

[51361 rows x 18 columns]

In [27]:
# Fill in missing data with zeros
# Uncomment the line below after running previous lines
df8.fillna(0)
df8.head(3)

  PRODUCT  VALUE              DATE_TIME  ...          AREA   CELL_ID_y   SITE_CODE
0     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  24ccdda3d5  1b5540c02d
1     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  ebfc58af70  1b5540c02d
2     sms      0  2012-05-07 00:00:00.0  ...  CENTRE NORTH  ba8ce6e4ef  1b5540c02d

[3 rows x 18 columns]

# Data Analysis

In [28]:
#Which ones were the most used city for the three days?

grouped = df8.groupby(['VILLES','PRODUCT'])['VALUE'].sum()
grouped

VILLES       PRODUCT
ABENGOUROU   Voice       7059
             sms         1650
ABOBO        Voice      96742
             sms        29179
ABOISSO      Voice       1608
                        ...
ZON-HOUNIEN  Voice        363
ZOUKOUGBEU   Voice        564
             sms          150
ZUENOULA     Voice       3546
             sms          300
Name: VALUE, Length: 601, dtype: int64

In [29]:
#Which cities were the most used during business and home hours?
#
grouped = df8.groupby(['VILLES','DATE_TIME','PRODUCT'])['VALUE'].sum()
grouped

#grouped = df8.groupby(["datetime"].dt.weekday, 'VILLES'])['VALUE'].sum()

VILLES      DATE_TIME              PRODUCT
ABENGOUROU  2012-05-07 00:00:02.0  sms          0
            2012-05-07 00:00:07.0  Voice      588
            2012-05-07 00:00:19.0  Voice       36
            2012-05-07 00:00:21.0  Voice       99
            2012-05-07 00:00:23.0  Voice      102
                                             ...
ZUENOULA    2012-05-09 00:00:24.0  sms          0
            2012-05-09 00:01:00.0  Voice      102
            2012-05-09 00:01:06.0  sms          0
            2012-05-09 00:01:16.0  Voice        0
            2012-05-09 00:01:37.0  sms          0
Name: VALUE, Length: 7375, dtype: int64

In [30]:
#Most used city for the three days?

grouped = df8.groupby(['VILLES','PRODUCT'])['VALUE'].max()
grouped

VILLES       PRODUCT
ABENGOUROU   Voice       480
             sms          50
ABOBO        Voice      3380
             sms         100
ABOISSO      Voice       180
                        ...
ZON-HOUNIEN  Voice       100
ZOUKOUGBEU   Voice       136
             sms          25
ZUENOULA     Voice       476
             sms          50
Name: VALUE, Length: 601, dtype: int64

In [ ]:
# How many calls, texts, and data are sent per city, split by date_time?
grouped = df8.groupby(['VILLES', 'PRODUCT'])['DATE_TIME'].count()
grouped

VILLES       PRODUCT
ABENGOUROU   Voice       11
             data         4
             sms          6
ABOBO        Voice      125
             data        24
                       ...
ZIKISSO      sms          4
ZON-HOUNIEN  Voice        2
             sms          1
ZOUKOUGBEU   Voice        3
ZUENOULA     Voice        9
Name: DATE_TIME, Length: 705, dtype: int64